Revit 2027 API
AirSystemData.HeatExchangerType Property
 The type of heat exchanger.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AirHeatExchangerType HeatExchangerType { get; set; }
Public Property HeatExchangerType As AirHeatExchangerType
	Get
	Set
public:
property AirHeatExchangerType HeatExchangerType {
	AirHeatExchangerType get ();
	void set (AirHeatExchangerType value);
}
member HeatExchangerType : AirHeatExchangerType with get, set
Property Value
AirHeatExchangerType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
AirSystemData Class
Autodesk.Revit.DB.Mechanical Namespace